---
kind: method
id: M:Autodesk.Revit.DB.FabricationDimensionDefinition.Dispose
source: html/af3026f4-57a4-201a-c238-0157169d40bc.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition.Dispose Method

Releases all resources used by the FabricationDimensionDefinition

## Syntax (C#)
```csharp
public void Dispose()
```